{"_id":{"$oid":"5dbeb7d2cdb700e273c1add8"},"title":"Пишут ли программисты код?","url":"pishut-li-programmisty-kod","text":"<p>Основная работа программиста заключается в написании кода. Именно такого мнения придерживается большинство людей, которые знакомы с программированием в основном из голливудских фильмов, где программист набирает код со скоростью 500 символов в минуту. Код – это первая ассоциация всех людей, включая самих программистов, которая приходит в голову при слове “программирование”. Но действительно ли написание кода является ключевым аспектом в программировании? Давайте разбираться.</p> <p>Для начала уясним для чего вообще предназначено программирование. Оно предназначено для решения реальных человеческих проблем, таких как поиск оптимального маршрута перелета между странами, прогноз курса валют, заказ товаров на дом и многих других. Инструментом для решения таких задач является программный код, который как и любой другой инструмент бесполезен, пока нет проработанного видения решения и четкого плана работ. Следовательно, перед тем как приступать к написанию программного кода, задача должна быть полностью решена в голове. </p> <p>Ведь когда некоторый заказчик ставит перед программистом задачу – то программист не приступает немедленно к написанию кода. Вначале программист должен переварить требования заказчика, решить задачу у себя в голове, изобразить решение схематически на доске или клочке бумаги, найти как можно больше слабых мест своего же решения, улучшить свое решение. И только после того как задача решена на бумаге, можно приступать к написанию кода.</p>  <p>Например, перед имплементацией такого сервиса как Instagram, программист должен спроектировать отдельные сервисы для загрузки и чтения изображений, спроектировать схему хранилища для самих изображений и их метаданных, продумать механизмы репликации, резервного копирования, кеширования, обновления данных в реальном времени, балансировку нагрузки и много другого.</p>  <p>Даже имплементация чего-то более простого, как например функционала регистрации пользователей, требует проектирования таблиц базы данных для хранения информации о пользователях, проектирования классов и методов, которые будут отвечать за сохранение и извлечение данных из базы, продумывания валидации, обработки ошибок, пользовательского интерфейса, формата передачи данных между клиентом и сервером и так далее.</p>    <p>Написать код по готовой задаче может и вчерашний выпускник компьютерной академии, а грамотно спроектировать задачу может только программист, обладающий большим опытом, аналитическим мышлением и прочными фундаментальными знаниями компьютерных наук.</p>","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"2"}}
{"_id":{"$oid":"5dbeb8c3cdb700e273c1ae1b"},"title":"Причины появления спагетти-кода","url":"prichiny-poyavleniya-spagetti-koda","text":"<p>Спагетти-кодом обычно называют очень запутанный, неразборчивый программный код, чтение которого вызывает только раздражение и злость. Программисту обычно требуется минимум в несколько раз больше времени на чтение спагетти-кода, чем хорошего структурированного кода. В спагетти-код крайне опасно вносить изменения, так как это может привести к непредсказуемым ошибкам в работе всей программы. Спагетти-код далеко не является редкостью в современной IT индустрии. Множество программ имеют в себе фрагменты спагетти-кода, что приводит к увеличению стоимости программного обеспечения, а также мягко говоря к недовольству программистов, которым приходится с таким наследием работать. Так каковы же причины появления спагетти? Давайте разбираться.</p><p>Первая причина появления спагетти заключается в ходе мышления программиста, во время имплементации задачи. Ведь на самом деле любой программный код отражает ход мыслей того программиста, который его писал. И если в голове человека во время написания кода был бардак, то программный код непременно покажет действительность.</p><p>Представьте человека, которому необходимо попасть из точки А в точку B по кратчайшему пути. Если перед началом движения человек хорошо подумает свой путь и изучит карту, то вероятно он преодолеет расстояние максимально быстро. Но если путешественник начнет идти наобум безо всякого планирования, то его путь будет крайне запутанным и даже до пунтка назначения можно не добраться и вовсе.</p><p>Вторая причина появления спагетти заключается в банальной Нехватке времени и Спешке. Программист может обладать прекрасным аналитическим мышлением, большим опытом и знаниями, однако он все равно может писать спагетти-код, если ему не хватает времени на предварительное обдумывание своего решения. А спешить программисты могут например по причине спешки заказчика, который боится проиграть своим конкурентам.</p><p>В современных IT реалиях тяжело выделить какую-то одну причину появления спагетти-кода - обе они занимают равноправные позиции.</p> <p>Для борьбы со спагетти-кодом используют статические анализаторы кода. Они способны просканировать всю кодовую базу проекта, которая обычно составляет сотни тысяч строк кода, и показать в каких же местах завалялось протухшее спагетти. После обнаружения спагетти, программисты начинают процесс рефакторинга, цель которого улучшить качество кода, не повлияв на поведение программы. В итоге после успешного рефакторинга, спагетти-код из запутанного и нечитабельного превращается в структурированный и понятный, то есть в лазанья-код.</p>","created":{"$date":{"$numberLong":"1572732000000"}},"type":{"$numberInt":"2"}}
{"_id":{"$oid":"5dbecc34cdb700e273c1b326"},"title":"Какой тип IT-компании выбрать программисту?","url":"kakoy-tip-it-kompanii-vybrat-programmistu","text":"","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"1"}}
{"_id":{"$oid":"5dbecc37cdb700e273c1b32c"},"title":"Не дается обучение программированию?","url":"ne-dayetsya-obucheniye-programmirovaniyu","text":"","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"3"}}
{"_id":{"$oid":"5dbecc39cdb700e273c1b330"},"title":"Как программисту без опыта найти работу?","url":"kak-programmistu-bez-opyta-nayti-rabotu","text":"","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"3"}}
{"_id":{"$oid":"5dbecc3bcdb700e273c1b334"},"title":"В чем разница между Junior, Middle и Senior программистами?","url":"v-chem-raznitsa-mezhdu-junior-middle-i-senior-programmistami","text":"","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"1"}}
{"_id":{"$oid":"5dbecc3dcdb700e273c1b33a"},"title":"Cленг программистов в IT","url":"sleng-programmistov-v-it","text":"","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"1"}}
{"_id":{"$oid":"5dbecc3fcdb700e273c1b33e"},"title":"пропущено специально","url":"sleng-programmistov-v-it","text":"","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"2"}}
{"_id":{"$oid":"5dbecc41cdb700e273c1b344"},"title":"Нужны ли программисту сертификаты?","url":"nuzhny-li-programmistu-sertifikaty","text":"","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"1"}}
{"_id":{"$oid":"5dbecc43cdb700e273c1b348"},"title":"Junior developer, повышаем твои шансы на прохождение собеседования","url":"junior-developer-povyshayem-tvoi-shansy-na-prokhozhdeniye-sobesedovaniya","text":"","created":{"$date":{"$numberLong":"1572735600000"}},"type":{"$numberInt":"3"}}
