{"_id":{"$oid":"5dbeb7d2cdb700e273c1add8"},"Title":"Пишут ли программисты код?","Url":"pishut-li-programmisty-kod","Text":"<p>Основная работа программиста заключается в написании кода. Именно такого мнения придерживается большинство людей, которые знакомы с программированием в основном из голливудских фильмов, где программист набирает код со скоростью 500 символов в минуту. Код – это первая ассоциация всех людей, включая самих программистов, которая приходит в голову при слове “программирование”. Но действительно ли написание кода является ключевым аспектом в программировании? Давайте разбираться.</p>{ad}<p>Для начала уясним для чего вообще предназначено программирование. Оно предназначено для решения реальных человеческих проблем, таких как поиск оптимального маршрута перелета между странами, прогноз курса валют, заказ товаров на дом и многих других. Инструментом для решения таких задач является программный код, который как и любой другой инструмент бесполезен, пока нет проработанного видения решения и четкого плана работ. Следовательно, перед тем как приступать к написанию программного кода, задача должна быть полностью решена в голове. </p> <p>Ведь когда некоторый заказчик ставит перед программистом задачу – то программист не приступает немедленно к написанию кода. Вначале программист должен переварить требования заказчика, решить задачу у себя в голове, изобразить решение схематически на доске или клочке бумаги, найти как можно больше слабых мест своего же решения, улучшить свое решение. И только после того как задача решена на бумаге, можно приступать к написанию кода.</p>  <p>Например, перед имплементацией такого сервиса как Instagram, программист должен спроектировать отдельные сервисы для загрузки и чтения изображений, спроектировать схему хранилища для самих изображений и их метаданных, продумать механизмы репликации, резервного копирования, кеширования, обновления данных в реальном времени, балансировку нагрузки и много другого.</p>  <p>Даже имплементация чего-то более простого, как например функционала регистрации пользователей, требует проектирования таблиц базы данных для хранения информации о пользователях, проектирования классов и методов, которые будут отвечать за сохранение и извлечение данных из базы, продумывания валидации, обработки ошибок, пользовательского интерфейса, формата передачи данных между клиентом и сервером и так далее.</p>    <p>Написать код по готовой задаче может и вчерашний выпускник компьютерной академии, а грамотно спроектировать задачу может только программист, обладающий большим опытом, аналитическим мышлением и прочными фундаментальными знаниями компьютерных наук.</p>","Created":{"$date":{"$numberLong":"1575057600000"}},"Description":"Пишут ли программисты код регулярно или их работа заключается совсем в ином?","Type":{"$numberInt":"2"},"Views":{"$numberInt":"89"},"CommentsCount":{"$numberInt":"0"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Tags":["rabotaprogrammista"]}
{"_id":{"$oid":"5dbeb8c3cdb700e273c1ae1b"},"Title":"Причины появления спагетти-кода","Url":"prichiny-poyavleniya-spagetti-koda","Text":"<p>Спагетти-кодом обычно называют очень запутанный, неразборчивый программный код, чтение которого вызывает только раздражение и злость. Программисту обычно требуется минимум в несколько раз больше времени на чтение спагетти-кода, чем хорошего структурированного кода. В спагетти-код крайне опасно вносить изменения, так как это может привести к непредсказуемым ошибкам в работе всей программы. Спагетти-код далеко не является редкостью в современной IT индустрии. Множество программ имеют в себе фрагменты спагетти-кода, что приводит к увеличению стоимости программного обеспечения, а также мягко говоря к недовольству программистов, которым приходится с таким наследием работать. Так каковы же причины появления спагетти? Давайте разбираться.</p>{ad}<h3>Код отражает ход мыслей программиста</h3><p>Первая причина появления спагетти заключается в ходе мышления программиста, во время имплементации задачи. Ведь на самом деле любой программный код отражает ход мыслей того программиста, который его писал. И если в голове человека во время написания кода был бардак, то программный код непременно покажет действительность.</p><p>Представьте человека, которому необходимо попасть из точки А в точку B по кратчайшему пути. Если перед началом движения человек хорошо подумает свой путь и изучит карту, то вероятно он преодолеет расстояние максимально быстро. Но если путешественник начнет идти наобум безо всякого планирования, то его путь будет крайне запутанным и даже до пунтка назначения можно не добраться и вовсе.</p><h3>Время - деньги</h3><p>Вторая причина появления спагетти заключается в банальной Нехватке времени и Спешке. Программист может обладать прекрасным аналитическим мышлением, большим опытом и знаниями, однако он все равно может писать спагетти-код, если ему не хватает времени на предварительное обдумывание своего решения. А спешить программисты могут например по причине спешки заказчика, который боится проиграть своим конкурентам.</p><p>В современных IT реалиях тяжело выделить какую-то одну причину появления спагетти-кода - обе они занимают равноправные позиции.</p> <p>Для борьбы со спагетти-кодом используют статические анализаторы кода. Они способны просканировать всю кодовую базу проекта, которая обычно составляет сотни тысяч строк кода, и показать в каких же местах завалялось протухшее спагетти. После обнаружения спагетти, программисты начинают процесс рефакторинга, цель которого улучшить качество кода, не повлияв на поведение программы. В итоге после успешного рефакторинга, спагетти-код из запутанного и нечитабельного превращается в структурированный и понятный, то есть в лазанья-код.</p>","Created":{"$date":{"$numberLong":"1575230400000"}},"Description":"Спагетти-код - это не пункт меню в тематическом IT-кафе, а некачественный код, который каждый программист избегает как только может.","Type":{"$numberInt":"2"},"CommentsCount":{"$numberInt":"0"},"Views":{"$numberInt":"79"},"WhoDisliked":[],"WhoLiked":[],"Tags":["quality","rabotaprogrammista"]}
{"_id":{"$oid":"5dbecc34cdb700e273c1b326"},"Title":"Какой тип IT-компании выбрать программисту?","Url":"kakoy-tip-it-kompanii-vybrat-programmistu","Text":"<p>Компании по разработке программного обеспечения можно разделить на три больших группы, а именно <b>аутсорсинговые компании</b>, <b>продуктовые компании</b> и <b>аутстаффинговые компании</b>. В чем их сходства и отличия? Давайте разбираться.</p>{ad}<h3>Аутсорсинговая компания</h3><p>Аутсорсинговая компания (outsourcing) - занимается разработкой программного обеспечения, а также поддержкой и обслуживанием программного обеспечения от различных заказчиков. Успех компании полностью зависит от количества привлеченных заказчиков и их уровня. Аутсорсинговая компания зарабатывает на разнице между тем, что платит заказчик компании и тем, что компания платит программисту. В большой аутсорсинговой компании есть возможность часто менять проекты, что позволяет получить расширить опыт в технологиях и в подходах разработки программного обеспечения. К недостаткам аутсорса относится большая вероятность работы с некачественным кодом, чем в продуктовых компаниях.</p><h3>Продуктовая компания</h3><p>Продуктовая компания (product) - занимается разработкой своего собственного продукта или нескольких продуктов. Часто такая компания нанимает специалистов, которые необходимы на всех этапах жизненного цикла программного продукта, начиная от программистов и заканчивая маркетологами. Успех продуктовых компаний зависит от того, как хорошо их продукт продается на рынке. К известным продуктовым компаниям относятся Google, Facebook, Booking и другие. В продуктовых компаниях программист ограничен теми языками программирования и технологиями, при помощи которых разрабатывается продукт, но качество кода обычно на порядок выше, чем в аутсорсе. Также некоторым программистам важно не просто работать и получать деньги за выполненную работу, а стать частью какого-то серьезного и именитого продукта.</p><h3>Аутстаффинговая компания</h3><p>Аутстаффинговые компании (outstaffing) - занимаются простой продажей человеко-часов заказчикам. Аутстаффинговая компания представляет собой обычного посредника между программистом и заказчиком. Программист регулярно коммуницирует с заказчиком и выполняет поставленные заказчиком задачи. Не редко заказчик попросту доукомплектовывает собственную команду программистов, обращаясь в аутстаффинговую компанию. В аутстафинговых компаниях так же как и в аутсорсе существует возможность менять заказчиков. Работа в аутстаффинговых компаниях обычно подходит для матерых программистов, так как необходимо регулярно общаться с заказчиком и отвечать за свои решения непосредственно перед ним. </p>","Created":{"$date":{"$numberLong":"1575316800000"}},"Description":"Аутсорсинговые (outsourcing), продуктовые (product) и аутстаффинговые (outstaffing) компании - разбираемся с их сходствами и отличиями.","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":[],"Views":{"$numberInt":"67"},"CommentsCount":{"$numberInt":"0"},"Tags":["itcompany","rabotaprogrammista"]}
{"_id":{"$oid":"5dbecc37cdb700e273c1b32c"},"Title":"Не дается обучение программированию?","Url":"ne-dayetsya-obucheniye-programmirovaniyu","Text":"<p>Работая преподавателем в компьютерной академии, я многократно подмечал любопытную особенность. Многие из тех студентов которые начали свое обучение с полного нуля, в течение многих месяцев практически не сдвигались с места в познании программирования. Однако в какой-то один момент, обычно спустя 4-6 месяцев со старта обучения, происходил внезапный и внушительный сдвиг, после которого студенты начинали осваивать новые знания какими-то ранее невиданными ранее темпами. В чем же причина такого резкого сдвига? Давайте разбираться.</p>{ad}  <p>Несмотря на то, что программирование является точной наукой, оно все равно воспринимается начинающими студентами как нечто абстрактное или даже магическое. Почему так происходит? Смотрите, дело в том, что в процессе чтения и трансформации программного кода во что-то работающее, принимают участие процессор и оперативная память. Процессор выполняет написанные программные команды, изменяя состояние оперативной памяти. Например, процессор понимает что вот такая написанная программистом команда</p> <p>int val = 41;</p> <p>необходима для создания ячейки в оперативной памяти с цифрой 41.</p> <p>Так вот и процессор и оперативная память являются такими вещами, которые нельзя потрогать, рассмотреть под увеличительным стеклом и четко увидеть их работу. По сути программист работает с черным ящиком, в который он отправляет какие-то команды, а они там магическим образом превращаются в функциональные программы.</p> <p>И вот именно с попытками <u>понять черный ящик</u> и связанно многомесячное стояние на месте некоторых людей, которые начинают изучать программирование. И тут главное не бросить обучение до момента, как барьер будет преодолен.</p><h3>Как можно больше иллюстраций</h3><p>Для максимального сокращения время преодоления барьера необходимы картинки. Любая хорошая книга по программированию содержит схематические иллюстрации к тексту, которые например визуализируют результат выполнения программного кода в оперативной памяти компьютера.</p> <p>Вы можете требовать от своего преподавателя иллюстрировать свои объяснения, а также пытаться регулярно рисовать такие иллюстрации самостоятельно. Как уже упоминалось раньше, многие из написанных вами команд изменяют состояние оперативной памяти. Поэтому будет отлично если вы будете рисовать отдельную схематическую иллюстрацию, на все возможные состояния оперативной, которое создается в результате выполнения вашего кода. Например, если вы написали вот такой код который суммирует все элементы массива</p> <p><img src='https://storage.googleapis.com/youit/images/for-loop-sum-array.png' alt='Цикл, сумма элементов массива' class='image-in-post' /></p> то попробуйте его визуализировать. У вас должно получиться примерно такое: <p><img src='https://storage.googleapis.com/youit/images/stack-heap.png' alt='Стек и куча' class='image-in-post' /></p> <p>И чем больше иллюстраций вы разберете и составите самостоятельно, тем быстрее барьер будет преодолен.</p>","Created":{"$date":{"$numberLong":"1575320400000"}},"Description":"Почему изучение программирования может казаться непреодолимым в начале пути и как сдвинуться с мертвой точки.","Type":{"$numberInt":"2"},"WhoDisliked":[],"WhoLiked":[],"Views":{"$numberInt":"105"},"CommentsCount":{"$numberInt":"0"},"Tags":["learning","programming","junior"]}
{"_id":{"$oid":"5dbecc39cdb700e273c1b330"},"Title":"Как найти работу программиста без опыта?","Url":"kak-programmistu-bez-opyta-nayti-rabotu","Text":"<p>Распространенной причиной отказов в трудоустройстве начинающим программистам является отсутствие опыта работы. Безусловно каждой компании необходим человек, способный прийти на работу и сразу без продолжительного обучения начать решать реальные боевые задачи. И подобное положение дел демотивирует некоторых соискателей на дальнейшие поиски. Ведь по факту люди попадают в замкнутый круг, в котором для получения опыта необходимо устроиться на работу, на которую не берут без опыта. Как же разорвать этот круг? Давайте разбираться.</p>{ad}<p>Одна из особенностей программирования, которой обладает не каждая профессия, заключается в том, что опыт и навыки, приближенные к реальным, можно получить самостоятельно у себя дома сидя за компьютером. Для этого необходимо придумать самому себе какой-нибудь проект, например интернет-магазин или приложение для подсчета калорий, и реализовать его. Ключевым критерием собственного проекта или его еще называют pet-проект, является <b>его завершенность</b>. То есть ваш проект должен как минимум компилироваться и запускаться, а также реализовывать весь основной функционал подобных реальных программ. Например если вы решили сделать интернет-магазин, то в нем должны быть реализованы как минимум следующие функции:</p> <ul><li>отображение товаров по категориям</li> <li>поиск товаров</li><li>корзина заказов</li><li>аутентификация и авторизация пользователей<li>панель администратора для добавления товаров в магазин</li></ul><h3>Проект не ради проекта, ради знаний</h3><p>Также важно не просто сделать проект работающий, а сделать его как можно более правильнее с точки зрения лучших практик программирования, стандартов кода, принципов и шаблонов проектирования. Для этого ставьте под сомнение каждое свое микро-решение во время разработки и пытайтесь загуглить как нужно делать правильно. Поверьте, что практически любая задача уже была решена до вас, от не требуется изобретать велосипед, а только уметь уместно использовать стандартные решения. Такой подход отнимет у вас в раза два больше времени на разработку проекта, но позволит вам получить ценные знания, которые помогут вам при прохождении интервью и покажут вас как крайне целеустремленного молодого специалиста.</p>","Created":{"$date":{"$numberLong":"1575403200000"}},"Type":{"$numberInt":"1"},"Views":{"$numberInt":"85"},"Description":"Распространенной причиной отказов в трудоустройстве начинающим программистам является отсутствие опыта работы. Безусловно каждой компании необходим человек, способный прийти на работу и сразу без продолжительного обучения начать решать реальные боевые задачи. И подобное положение дел демотивирует некоторых соискателей на дальнейшие поиски.","CommentsCount":{"$numberInt":"0"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Tags":["junior","carrier"]}
{"_id":{"$oid":"5dbecc3bcdb700e273c1b334"},"Title":"В чем разница между Junior, Middle и Senior программистами?","Url":"v-chem-raznitsa-mezhdu-junior-middle-i-senior-programmistami","Text":"<p>Программистов обычно классифицируют на три категории по их знаниям и опыту работы, а именно на Junior, Middle и Senior. Какие существуют различия между тремя должностями, давайте разбираться.</p>{ad}<h3>Junior</h3><p>Junior - это программист который имеет небольшой опыт в разработке программного обеспечения, обычно до 1-2 лет. На данном уровне программист должен хорошо знать свой язык программирования, а также хорошо ориентироваться в смежных технологиях. Например, если речь идет о .NET программисте, то он должен знать язык C# а также ориентироваться в многопоточности, реляционных базах данных, модульном тестировании, технологиях ORM, системах контроля версий. Джуниоры могут работать самостоятельно в основном решая мелкие задачи, то есть исправляя дефекты или реализуя маленькие неключевые фрагменты системы. Все остальное выполняется под руководством более опытных коллег.</p><h3>Middle</h3><p>Следующим этапом развития в карьере является позиция Middle. Отличие от Джуниор заключается в том, что Мидл может выполнять большой спектр задач уже самостоятельно без надзора опытных коллег, за исключением реализации комплексных компонентов системы.  Мидл достаточно хорошо владеет своим языком программирования и технологиями, неплохо ориентируется в шаблонах и практиках проектирования. Также он понимает основные бизнес-процессы своего заказчика, что позволяет ему реализовывать задачи более осмысленно и замечать просчеты в описанных к функциональности требованиях.</p><h3>Senior</h3><p>Следующая позиция это Senior. Senior имеет за спиной серьезный багаж опыта в виде тысяч решенных ранее задач, что позволяет ему принимать правильные технологические решения, а решать проблемы еще до их появления. Senior уже может разрабатывать комплексные компоненты программного обеспечения самостоятельно, а также брать на себя полную ответственность за результат. Синьйору необходимо понимать внутреннее устройство библиотек и фреймворков, которые он использует в своей работе. Хороший синьор помимо технических умений должен иметь также хорошие коммуникативные навыки, ведь ему часто приходится доносить свои мысли другим своим подчиненным и заказчику.</p><h3>А что дальше?</h3><p>Стоит отметить, что позиция синьора не является карьерным пределом для программиста. После синьора можно стать техническим лидером либо архитектором. Однако обе эти должности скорее являются не логическим и обязательным шагом в карьере, а шагом немного в сторону с пути программиста. Ведь что технический лидер, что архитектор в силу специфики своих должностей не заняты ежедневным написанием кода - появляется множество дополнительных обязанностей, в числе которых менеджмент, работа с документацией, регулярные коммуникация со стейкхолдерами и другие. По этой причине программист теряет возможность регулярно писать код, а такое положение дел не является приемлемым для настоящего программиста.</p>","Created":{"$date":{"$numberLong":"1575489600000"}},"Description":"Рассмотрим разницу между Junior, Middle и Senior программистами, а также существует ли рост после достижения позиции Senior.","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":[],"Views":{"$numberInt":"88"},"CommentsCount":{"$numberInt":"0"},"Tags":["rabotaprogrammista","carrier"]}
{"_id":{"$oid":"5dbecc3dcdb700e273c1b33a"},"Title":"Cленг программистов в IT","Url":"sleng-programmistov-v-it","Text":"<p>Если вы считаете, что русскоязычный программист в общении со своими коллегами использует русский язык - то это не совсем так. При прослушивании разговора двух программистов на работе, вы скорее всего поймете не более половины их диалога без должной подготовки. И тут дело вовсе не в оперировании техническими терминами или проблемами с дикцией. В чем же дело? Давайте разбираться.</p>{ad}<p>Все дело в IT-шном сленге, который представляет собой объединение русского языка с вкраплением множества английских слов. Вот несколько фраз на таком сленге:</p><p><i>“Я подконекчусь (to connect) на кол (a call) с кастомером через 5 минут”</i></p><p><i>“Нужно срочно заимплементить (to implement) фичу (a feature) и залить ее на прод (production)”</i></p><p><i>“Этот баг (bug) можно пофиксить (to fix) только оверрайднув (to override) метод”</i></p><p>Как видите, некоторые русские слова заменяются английскими и произносятся на русский лад. Для неподготовленного человека подобный сленг может показаться желанием просто повыпендриваться, показать свою крутость в такой странный способ. Однако причины появления такого сленга кроются совсем в другой плоскости.</p> <p>Дело в том, что программист регулярно контактирует с англоязычной средой - общается с заказчиками на английском, читает документацию. И даже сам программный код, который программист пишет изо дня в день, имеет множество английских ключевых слов. Например, вот так выглядит код, который загрузил из базы данных для вас этот пост:</p><p><img src='https://storage.googleapis.com/youit/images/getpostqueryhandler-c%23.png' class='image-in-post' alt='Get Post Query Handler in C#' /></p><p>Так или иначе различные английские слова постепенно просачиваются в русский, особенно когда сам русский язык не имеет подходящего, короткого и удобного в произношении слова-аналога. Например, тяжело найти адекватный аналог в русском языке таким распространенным понятиям среди программистов как production environment, release или feature. Таким образом английские слова просто заполняют существующие пробелы русского. И не более того.</p>","Created":{"$date":{"$numberLong":"1575576000000"}},"Type":{"$numberInt":"1"},"Description":"Фича, оверрайднуть, на коле - почему программисты разговаривают на непонятном сленге, какие причины его появления, примеры фраз.","WhoDisliked":[],"WhoLiked":[],"Views":{"$numberInt":"83"},"CommentsCount":{"$numberInt":"0"},"Tags":["rabotaprogrammista"]}
{"_id":{"$oid":"5dbecc3fcdb700e273c1b33e"},"Title":"Junior C#! Не иди на собеседование, если не знаешь ответов на такие вопросы","Url":"junior-csharp-ne-idi-na-sobesedovaniye-esli-ne-znayesh-otvetov-na-takiye-voprosy","Text":"<p>Разработка программного обеспечения является настолько безграничной темой, что по ней можно поставить бесчисленное количество вопросов. Несмотря на подобное разнообразие, существует небольшой ряд фундаментальные вопросов, без которых не обходится ни одно собеседование по C# на должность Junior C# Developer. И незнание ответов на эти вопросы поставит под сомнение ваше потенциальное попадание на работу, невзирая на то как вы справитесь с другими менее фундаментальными вопросами.</p><p>Итак, не идите на собеседование, если вы не знаете ответов на перечисленные ниже вопросы.</p>{ad}<i><h3>C#</h3>Как работает JIT компиляция?</br>В чем разница между ссылочными и значимыми типами данных? <br/>Опишите работу сборщика мусора? <br/>Каково предназначение делегатов и событий?<br/>В чем разница между интерфейсом и абстрактным классом? <br/>Какая цель у интерфейсов IEnumerable и IEnumerator? <br/>В чем разница между типами String и StringBuilder? <br/>От какого базового типа наследуются все типы в .NET? <br/>В чем смысл процессов сериализации и десериализации? <br/>Чем коллекция Dictionary отличается от HashSet? <br/><h3>ООП</h3>Какие концепции ООП вы знаете? <br/>В чем разница между Абстракцией и Инкапсуляцией? <br/>Какие принципы SOLID вам знакомы? <br/>Что означает “Внедрение зависимостей”?<br/>В чем недостатки шаблона проектирования Одиночки или Singleton? <br/><h3>MSSQL</h3>Как создать связь многие ко многим? <br/>В чем преимущества нормализации данных? <br/>Для чего используется оператор HAVING? <br/>Как работает оператор INNER JOIN? <br/><h3>Алгоритмы</h3>В чем разница между структурами Stack, Queue и LinkedList? <br/>Как работает бинарный поиск? <br/>Как устроены хеш-таблицы<br/>Можете ли вы изобразить на листочке как выглядит бинарное дерево?</i> <br/><p><br/>Если вы не знаете ответа на какой-то из вышеперечисленных вопросов, давайте обсудим его в комментариях.</p>","Created":{"$date":{"$numberLong":"1575662400000"}},"Type":{"$numberInt":"2"},"Description":"Разработка программного обеспечения является настолько безграничной темой, что по ней можно поставить бесчисленное количество вопросов.","WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Views":{"$numberInt":"113"},"CommentsCount":{"$numberInt":"0"},"Tags":["interview","csharp","carrier"]}
{"_id":{"$oid":"5dbecc41cdb700e273c1b344"},"Title":"Нужны ли программисту сертификаты?","Url":"nuzhny-li-programmistu-sertifikaty","Text":"<p>В наше время существует огромное количество сертификаций, которые покрывают практически все инструменты IT-сферы, начиная от сертификаций по языкам программирования и заканчивая сертификациями по процессам разработки программного обеспечения. Программист, обладающий рядом сертификатов, выглядит крутым парнем и должен значительно выделяться в глазах своего работодателя и среди остальных коллег, которые этих самых сертификатов не имеют. Но действительно ли наличие сертификатов у программиста всегда свидетельствует о его крутости? Давайте разбираться.</p>{ad}<p>Сертификаты отличаются не только тематикой, но и уровнем на котором они покрывают определенную тему. И такие сертификаты нужно уметь отличать один от другого, особенно работодателю. Одни сертификаты практически не возможно получить без реального опыта работы, а другие выдаются просто за то, что человек прослушал определенный курс. Прослушать курс может каждый, поэтому работодателю очевидно не стоит обращать внимание на подобные сертификаты. А программистам тем более не стоит прикреплять их к своему резюме, даже если прикрепить больше нечего.</p><h3>Сертификат не ради сертификата</h3><p> Важную роль играет подход программиста к подготовке к  сертификации. Первый возможный подход заключается в подготовке к сертификации ради сдачи самой сертификации, иными словами ради получения заветной бумажки со штампом. Выбрав такой путь, программист будет заниматься не более чем заучиванием подобных вопросов из интернета, без глубокого погружения в тему. </p><p>Но есть и второй подход, который начинается с осознания того, что сам факт получения или неполучения сертификата не столь важен, как сам кропотливый процесс подготовки к нему. Регистрация на экзамен - это лишь стимул и очерченные временные рамки для изучения большого количества материала, на который раньше никак не хватало времени. При втором подходе, имеющиеся знания в голове упорядочиваются, а также приобретаются новые, вследствие чего программист несомненно будет нести большую ценность для работодателя. </p><p>Всегда выбирайте второй вариант, так как в долгосрочной перспективе он бесценен. С новыми полученными зданиями в процессе подготовки к сертификации вы станете увереннее себя чувствовать как при решении сложных задач, при прохождении собеседований и временно утолите свою жажду к новым знаниям.</p>","Created":{"$date":{"$numberLong":"1575748800000"}},"Type":{"$numberInt":"1"},"Description":"В наше время существует огромное количество сертификаций, которые покрывают практически все инструменты IT-сферы, начиная от сертификаций по языкам программирования и заканчивая сертификациями по процессам разработки программного обеспечения.","WhoDisliked":[],"WhoLiked":["5ddfe9e6048adc000129511e"],"Views":{"$numberInt":"87"},"CommentsCount":{"$numberInt":"0"},"Tags":["certificate"]}
{"_id":{"$oid":"5dbecc43cdb700e273c1b348"},"Title":"Junior developer, повышаем твои шансы на прохождение собеседования","Url":"junior-developer-povishayem-tvoi-shansy-na-prokhozhdeniye-sobesedovaniya","Text":"<p>Для того чтобы понять как повысить свои шансы на успешное прохождение собеседования, давайте сначала посмотрим на то как проходит обычное собеседование в среднестатистическую аутсорсинговую компанию.</p>{ad}<p>Вы приходите в офис и интервьюер начинает задавать вам вопросы, которые можно поделить на две категории: теоретические вопросы в основном по языку программирования, а также вопросы по вашему опыту работы. Но если вы начинающий разработчик, то интервьюер прекрасно понимает, что много о вашем опыте работы не поговоришь. Однако если вы еще не успели получить коммерческий опыт разработки, это не значит что приходить можно с пустыми руками. Сделайте небольшой pet-проект, который можно при необходимости презентовать. Однако даже с наличием собственного проекта, большая часть времени будет отведена под обычные теоретические вопросы. И ключевое слово здесь - Теория.</p><h3>Секрет в теории</h3><p>Для того, чтобы шансы на прохождения собеседования значительно возросли, вам необходимо научиться красиво и уверенно отвечать на распространенные теоретические вопросы по вашему языку программирования и смежным технологиям.</p><p>Вот представьте себе приятное изумление интервьюера, когда в ответ на вопрос: <i>“Что такое инкапсуляция?”</i> вместо невнятного и неправильного ответа <i>“инкапсуляция - сделать поля приватными”</i>, он слышит от вас ответ: <i>“ключевыми аспектами инкапсуляции являются защита инвариантов класса и сокрытие информации”</i>. Подобные ответы покажут вас как программиста, который не просто пишет код на автомате при помощи StackOverflow, а который всегда докапывается до сути и подходит к познанию своего дела как к науке, а не как к примитивному инструменту.</p><h3>Чтение как образ жизни</h3><p>Научиться грамотно отвечать намного проще чем, может показаться на первый взгляд. Необходимо лишь регулярно читать хорошие книги. Старайтесь читать их хорошем переводе на свой родной язык, ведь ваши первые собеседования будут скорее всего также на русском. Не упускайте из виду ни единой строчки книги, как какую-то сухую теорию. Делайте выписки всего что вы не поняли, и старайтесь найти доступное объяснение в интернете. Прорабатывайте весь новый материал, старайтесь каждой новой книгой или статьей переосмыслить то что вы уже знаете, и в долгосрочной перспективе вы будете приятно удивлены полученным результатом. </p>","Created":{"$date":{"$numberLong":"1575835200000"}},"Type":{"$numberInt":"1"},"Description":"Для того чтобы понять как повысить свои шансы на успешное прохождение собеседования, давайте сначала посмотрим на то как проходит обычное собеседование в среднестатистическую аутсорсинговую компанию.","WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Views":{"$numberInt":"122"},"CommentsCount":{"$numberInt":"2"},"Tags":["interview"]}
{"_id":{"$oid":"5de7dcf4264c0bcdadcf55f3"},"Title":"Как попасть в IT компанию НЕ программистом?","Url":"kak-popast-v-it-kompaniyu-ne-programmistom","Text":"<p>Если по каким-либо причинам вы не хотите становиться программистом, но очень хотите попасть на работу в IT-компанию, то существует целый список интересных альтернатив. Давайте с ними разбираться. </p>{ad}<p><b>Мануальный тестировщик/Quality Control (QC)/Quality Assurance (QA)</b> - работа заключается в ручном поиске дефектов или багов в программных продуктах. Профессия требует высокой внимательности и скрупулёзности. Обучиться мануальному тестированию можно самостоятельно путем чтения специализированной литературы, просмотром видео-курсов и презентаций. Практику можно получить путем тестирования различных сайтов, будь то amazon.com, youtube.com и прочие. </p><p><b>Автоматизатор/Automation Quality Control (ATQC)</b>  - работа заключается в написании специальных программ-тестов, которые способны автоматически тестировать программный продукт. Такие программы-тесты позволяют существенно снизить количество мануальных тестировщиков на проекте. Автоматизатор должен обладать знаниями языков программирования. Обычно автоматизаторы это перерожденные мануальные тестировщики. </p><p><b>Менеджер проектов/Project Manager (PM)</b>  - работа заключается в управлении командой разработчиков, контроле выполнения работ, поиск новых сотрудников, коммуникации с заказчиком, решение зарплатных вопросов и так далее. Менеджеры проектов должны хорошо понимать процессы по которым разрабатываются проекты. Поэтому перед тем как стать менеджером, человек должен поработать в IT-компании на другой должности. В подавляющем большинстве случаев менеджерами проектов становятся мануальные тестировщики. </p> <p><b>Бизнес-аналитик/Business Analyst (BA)</b>  - работа заключается в общении с заказчиком, выяснении его потребностей и документировании таких потребностей в виде текста и мокапов. Программисты разрабатывают программный продукт, четко следуя документации от бизнес-аналитика. BA должен отлично разбираться в бизнесе заказчика. Например, если заказчик хочет сайт для бронирования авиа-билетов, бизнес-аналитик должен знать все о видах билетов, скидках, правилах отмены резервации и так далее. </p> <p><b>Рекрутер/Human resources (HR)</b> - работа заключается в поиске сотрудников в компанию, например через сеть LinkedIn. Чтобы стать рекрутером, необходимо поверхностно ориентироваться в видах программного обеспечения, а также знать область применения основных языков программирования и фреймворков.</p><p>Как видите, вполне реально стать Рекрутером или мануальным тестировщиком без предварительного опыта в IT-сфере. Начните с одной из этих двух профессий, а после нескольких лет работы вам будет виднее сможете хотите ли вы кардинально менять направление или нет. </p>","Created":{"$date":{"$numberLong":"1575921600000"}},"Description":"Программисты - это далеко не единственные высокооплачиваемые представители IT-компаний. Разбираемся с целым списком других профессий.","Type":{"$numberInt":"1"},"CommentsCount":{"$numberInt":"1"},"Views":{"$numberInt":"153"},"WhoDisliked":[],"WhoLiked":["5de3a5147dd2f600019789ba"],"Tags":["itcompany","carrier"]}
{"_id":{"$oid":"5dedfe64264c0bcdadd16828"},"Title":"Простыми словами о понятии Баг в программировании","Url":"prostymi-slovami-o-ponyatii-bag-v-programmirovanii","Text":"<p>Никакие программы будь то приложение на смартфоне, веб-сайт или операционная система не застрахованы от появления в них багов. Баг или дефект - это отклонение в поведении программы от установленной нормы. А нормой является требование заказчика либо просто требование здравого смысла.</p>{ad}<ul>Вот некоторые примеры багов: <li>Пользователь кликает по ссылке “перейти” на сайте, но ничего не происходит в ответ</li><li>Некоторая кнопка во всех браузерах имеет красный цвет, а в Internet Edge она черная</li><li>Пользователь вводит правильные логин и пароль, но система его не пускает</li></ul><p><img src='https://storage.googleapis.com/youit/images/bag-w-programmirowanii.png' class='image-in-post' alt='Баги в программировании' /></p><p>Рассмотренные выше примеры багов относятся к таким очевидным багам, где любой бы человек заподозрил бы что-то неладное. Для этого необходимо просто обладать определенной долей здравого смысла.</p><p>К другой категории багов относятся такие, при которых программы с точки зрения здравого смысла обладают абсолютно адекватным поведением, но которое не соответствует требованиям заказчика. Например: </p><ul><li>По требованиям заказчика пользователь должен быть заблокирован в системе после 5 неправильных попыток ввести пароль, а по факту он блокируется уже после 3 попыток. </li></ul><h3>Как борются с багами</h3><p>Поиском багов занимаются мануальные тестировщики либо автоматизаторы. Все найденные баги подробно описываются в специальных баг-трекинг, одной из самых популярных является Jira. Впоследствии исправлением багов занимаются программисты, после чего вновь выполняется тестирование с целью проверить исправил ли программист баг, а также проверить не поломал ли он никакой другой функциональности. Обычно программный продукт к моменту своего релиза является тщательно оттестированным и не содержит багов. Однако в больших и сложных системах баги после релиза могут скрываться годами, пока случайно обнаруживаются обычными пользователями или теми же тестировщиками. </p>","Created":{"$date":{"$numberLong":"1576008000000"}},"Description":"Никакие программы не застрахованы от появления в них багов. Разбираемся с видами багов и причинами их появления.","Type":{"$numberInt":"2"},"WhoDisliked":[],"WhoLiked":[],"Views":{"$numberInt":"137"},"CommentsCount":{"$numberInt":"0"},"Tags":["programming","quality"]}
{"_id":{"$oid":"5df0d0b3264c0bcdadd26131"},"Title":"Джуниор программист с 10 годами опыта. Бред?","Url":"junior-programmer-s-10-godami-opyta-raboty-bred","Text":"<p>Мне приходится часто слышать на работе то, что уровень программиста, его профессионализм и соответственно ожидания к нему формируют при помощи такого показателя как количество отработанных программистом лет. Например, можно услышать такую фразу:</p><p><i>“У него 6 лет опыта работы, значит он Senior”</i></p> или <p><i>“Он работает уже 10 лет, следовательно может руководить проектом”. </i></p><p>Имеют ли смысл данные утверждения? Давайте разбираться.</p>{ad}<p>Работодатель, оценивающий уровень сотрудника а соответственно и уровень его зарплаты рискует очень сильно ошибиться и нанять на работу некомпетентного сотрудника, от которого будут лишь одни убытки. </p><h3>Правило предоставленного шанса</h3><p>Существует одно простое, но важное правило, о котором нужно помнить перед тем как оценивать программиста по количеству проработанных им лет: </p><p><b>Тот факт, что программист имеет за спиной большое количество лет опыта работы говорит лишь о том, что программист имел время и возможность получить ценные знания и навыки, но никак не говорит о том, смог ли он в действительности воспользоваться своим шансом.</b></p><p>Существуют программисты, которые по различным причинам годами сидят на одном проекте и занимаются в основном только исправлением мелких дефектов. В таком случае миф про джуниоров с 10 годами опыта приобретает реальные очертания. Безусловно, что это дело каждого человека как ему развиваться и нужно ли ему развитие как таковое. Кого-то устраивает текущая зарплата, кому-то комфортно годами работать с устаревшими системами, которые разработаны на невостребованных более на рынке технологиях. Человек сам способен оценить что ему нужно и если ему нужен рост, то он разберется как его получить.</p><p>В свою очередь работодателю или техническому эксперту для оценки реального уровня кандидата, необходимо говорить с ним о его опыте работы: спрашивать какие задачи он решал, как именно он их решал, какие он видит недостатки своих решений и какие способы их устранения существуют. Последние два пункта особенно важны, так как недостатки существуют абсолютно в любом решении - все зависит только от того с какой стороны посмотреть. И если для программиста его решение является идеальным на все случаи жизни, то это говорит не о его мастерстве, а лишь о “тунельности” его мышления и неспособности мыслить критически.</p><p>Полученные ответы о опыте интервьюер должен сопоставлять с теми задачами, которые необходимо решать его компании сейчас или в обозримом будущем для понимания того подходит ли человек или нет. А вот количеству лет опыта большого значения придавать не стоит. </p>","Created":{"$date":{"$numberLong":"1576026000000"}},"Description":"Могут ли программисты, имеющие за спиной 10 лет опыта, оставаться джуниорами?","Type":{"$numberInt":"2"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Views":{"$numberInt":"148"},"CommentsCount":{"$numberInt":"0"},"Tags":["rabotaprogrammista"]}
{"_id":{"$oid":"5df29dda264c0bcdadd2d6f1"},"Title":"Как долго нужно учиться с нуля до должности Trainee Software Engineer","Url":"kak-dolgo-nuzhno-uchitsya-s-nulya-do-dolzhnosti-trainee-software-engineer","Text":"<p>Сколько времени нужно учиться с нуля до должности Trainee Software Engineer? Я уверен, что подобным вопросом задаются все люди, которые поставили перед собой цель стать программистом. Напомню, что должность Trainee Software Engineer подразумевает наличие хороших теоретических знаний языка программирования, стандартов кодирования и принципов объектно-ориентированного программирования, а также общих знаний в ряде сопутствующих технологий и фреймворков.</p>{ad}<h3>Не оффлайн-обучением единым</h3><p>Продолжительность приобретения подобного багажа знаний конечно будет зависеть от выбранного направления в программировании и самих способностей человека. Когда-то давно продолжительность обучения также зависела исключительно от присутствия за плечом наставника в виде преподавателя, репетитора или просто знакомого опытного программиста. Однако на сегодняшний день в интернете существует масса исчерпывающих, прекрасно структурированных онлайн-курсов обучения, с возможностью задавать вопросы их авторам или другим начинающим программистам. Например, вы можете пользоваться такими отличными ресурсами как <a href=”https://www.codecademy.com/” target=”_blank”>www.codecademy.com</a> или <a href=”https://www.bitdegree.org” target=”_blank”>www.bitdegree.org</a>. Также вы можете самостоятельно найти еще массу подобных и главное не скупитесь на платную подписку, которые обычно открывают намного больше возможностей обучения, чем бесплатные версии.</p> <p>И помните, что самым главным фактором, влияющим на продолжительность обучения, является ваша систематичность и количество времени, которое вы можете выделять ежедневно. Если вы готовы тратить на свое обучение по два-три часа в день ежедневно с одним выходным в неделю, то продолжительность обучения до позиции Trainee Software Engineer займет у вас не более полутора лет, которые должны быть наполнены изучением теории с регулярными вкраплениями практики. </p><h3>Что и как нужно учить?</h3><p>Начните изучение с языка программирования и его основных команд. Откройте соответствующую книгу по языку программирования, изучите первую главу и напишите как можно больше простых, пусть и бессмысленных программ, используя полученные знания. Если сперва не получается написать программу самому, то перепишите из книги готовые примеры программ и сделайте в них самостоятельно так много изменений как только сможете, расширьте программу новыми командами и функциональностью. Переходите к изучению второй главы и снова повторите практику. К третьей и так далее.</p> <p>Когда вы почувствуете уверенность в работе с такими конструкциями как переменные, массивы, циклы, методы, арифметические переменные, включите в свое обучения простые алгоритмы, такие как линейный поиск, бинарный поиск, пузырьковая сортировка, сортировка вставками. Когда вы решите много задач с участием классов и объектов, включите в свою программу принципы объектно-ориентированного проектирования и простые шаблоны проектирования, таких как синглтон, декоратор, фабричный метод, строитель, фасад, медиатор и другие. </p> <p>Когда вы пройдете книгу по языку программирования и выполните сотни консольных задач, переходите к изучению интересующего вас фреймворка. Это может быть фреймворк для создания мобильных приложений или веб-сайтов. Разработайте полноценное приложение, реализуйте в нем основной функционал подобных существующих приложений и покройте его модульными тестами. По окончании этого шага Вы можете гордо называться Trainee Software Engineer.</p>","Created":{"$date":{"$numberLong":"1576173600000"}},"Description":"Сколько времени нужно учиться с нуля до должности Trainee Software Engineer?","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":[],"Views":{"$numberInt":"115"},"CommentsCount":{"$numberInt":"0"},"Tags":["carrier","learning"]}
{"_id":{"$oid":"5df4fb97264c0bcdadd36f2a"},"Title":"Программист-блогер: зачем программисту вести свой блог?","Url":"programmist-blogger-zachem-programmistu-vesti-svoj-blog","Text":"<p>Программист может вести собственный блог по различным причинам. Например, с целью прославиться, с целью получать дополнительный доход или с целью утолить свою жажду в необходимости делиться знаниями с окружающими. Какую бы из всех возможных целей не преследовал бы программист, ведение собственного блога является уникальным способом самообучения.</p>{ad}<p>Подготовка контента для собственного блога, такого как, статьи на определенные темы позволит вам структурировать и упорядочить у себя в голове то, что вы уже знаете и выучить новое. Причем я гарантирую, что достаточно часто при попытке написать статью на казалось бы хорошо знакомую вам тему вы можете испытывать сложности. Процесс изложения технических знаний “на бумаге” покажет вам, что на самом деле не так то и хорошо и не в полном объеме владеете темой. Одним из главных критериев понимания материала является способность доступно объяснить его другому человеку.</p> <p>Начинающим блогерам, можно дать три небольших рекомендации:</p><h3>#1 Не только Senior’ы пишут блоги</h3><p>Не обращайте внимания на свой уровень технический уровень, он не должен быть для вас оправданием не писать свой блог. Если вы опытный программист, пишите о интересных задачах которые вы решали или раскрывайте людям смысл интересующих их тем, например ООП, функциональное программирование, сборка мусора и т.д. Если вы начинающий программист, пишите о том что вы уже выучили, например, о необходимости переменных, недостатках пузырьковой сортировки, сравнении линейного и бинарного поисков и т.д. Помните то, что вне зависимости от вашего уровня вы сможете найти своего читателя и производить для него полезный контент.</p><h3>#2 Сбор и анализ информации</h3><img src='https://storage.googleapis.com/youit/images/informacia.png' class='image-in-post' alt='Информация' /><p>Вашей первоочередной целью должна быть качественная статья. После того как вы определились с темой статьи, не приступайте немедленно к ее написанию. Сначала прочтите как можно больше информации на выбранную тему в книгах, статьях других блогеров или обучающих видео-роликах. После проведенного исследования имеющихся материалов составьте план своей статьи и начните раскрывать пункт за пунктом пока статья не будет закончена.</p><h3>#3 Критерий завершенности – статья нравится автору</h3><p>Написанная вами статья должна вам нравиться. И после выполнения этого условия статья может быть представлена общественности. Для того, чтобы максимально объективно оценить собственный материал, забудьте о нем где-то дней на 5-7 после завершения работы над ним. А по прошествии этого срока перечитайте свою статью, вы гарантировано захотите отредактировать некоторые моменты, которых вы не заметили ранее из-за “замыленных глаз”.</p><p>На этом все. Попробуйте написать небольшую статью прямо сейчас, это будет очень интересно.</p>","Created":{"$date":{"$numberLong":"1576285200000"}},"Description":"Программист может вести собственный блог по различным причинам. Например, с целью прославиться, с целью получать дополнительный доход или с целью утолить свою жажду в необходимости делиться знаниями с окружающими.","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":[],"Views":{"$numberInt":"100"},"CommentsCount":{"$numberInt":"0"},"Tags":["learning"]}
{"_id":{"$oid":"5df6687e264c0bcdadd3d7f2"},"Title":"Как программисту правильно саморазвиваться?","Url":"kak-programmistu-pravilno-samorazvivatsya","Text":"<p>В саморазвитии, то есть в регулярном поглощении новых знаний, испытывают потребность не все программисты. Кто-то возможно уже ощущает себя достаточно “саморазвитым” и хочет переключить свою энергию на другие жизненные занятия. Кто-то имеет возможность регулярно менять проекты и решать самые разносторонние задачи ежедневно, что не видит необходимости тратить свое свободное время на еще большее развитие. Если вы не относитесь ни к первой, ни к второй категории людей и чувствуете необходимость развиваться постоянно, то вам нужно определиться как именно вы будете это делать, чтобы получить максимальную для себя выгоду.</p>{ad}<h3>Краткосрочный и долгосрочный план</h3><p>Начните с составления краткосрочного и долгосрочного планов саморазвития. Учтите, что сделать вы должны это самостоятельно, ведь вопрос саморазвития является крайне субъективным: то, что идеально подходит одному человеку далеко не обязательно подойдет другому. Наличие планов позволит вам не шататься из стороны в сторону, а идти прямым и кратчайшим путем. Под долгосрочным планом имеется ввиду план на год-два, а под краткосрочным - план на 1-3 месяца. Ваш долгосрочный план может не иметь четких деталей и выглядеть следующим образом:</p><i><ul><li>Выучить алгоритмы и структуры данных</li> <li>Выучить функциональный язык программирования</li> <li>Выучить шаблоны построения микросервисных систем</li></ul></i> <p>В свою очередь краткосрочный план должен фокусироваться на одной из тем долгосрочного, иметь конкретные подтемы для обучения и ссылки на необходимые обучающие материалы. Например, возьмем такую тему из долгосрочного плана как алгоритмы, для которой краткосрочный план может выглядеть следующим образом:</p> <i><ul><li>Выучить как оценивать сложность алгоритмов, Big O нотация</li><li>Выучить внутреннее устройство хеш-таблиц</li><li>Выучить алгоритмы обхода бинарных деревьев DFS и BFS</li><li>Выучить виды графов и алгоритмы поиска кратчайшего расстояния</li><li>Учить по курсу на Coursera, Robert Sedgewick</li></ul></i><h3>Баланс между теорией и практикой</h3><img src='https://storage.googleapis.com/youit/images/balans-teoria-praktika.png' class='image-in-post' alt='Баланс между теорией и практикой' /><p>После того, как оба плана готовы и вы уже начали по ним движение, то нащупайте свой баланс между теорией и практикой. Кто-то предпочитает сначала зачитываться в теорию и практиковаться только после того, как вся теория окончательно впитана в голову. Кто-то начинает сразу с практики и обращается к теории только при возникновении препятствий. Здесь нет правильного или неправильного подхода. Есть только подход, который больше соответствует лично вам и найти его можно только в процессе обучения постоянно экспериментируя.</p><h3>Систематичность обучения</h3><p>Внедрите обучение в свой образ жизни и учитесь систематически. Человек, который увлекается тренажерным залом, ходит в него трижды в неделю и занимается по полтора часа регулярно в течение многих лет. С самообучением должно быть точно также. Найдите свою схему, выберите подходящий для себя режим и строго придерживайтесь его. </p><p>Спустя некоторое время с момента начала занятий строго по графику, вы уже не сможете прожить и нескольких дней без дозы новых знаний.</p><h3>Сначала фундаментальные знания</h3><p>Всегда делайте акцент на фундаментальных знаниях, по той причине что они не устаревают, всегда оставаясь актуальными. Также хорошие фундаментальные знания намного упростят изучение новых языков программирования, фреймворков и т.д. Если вы планируете свой долгосрочный план, то лучше включите в него в первую очередь набор фундаментальных знаний, такие как, алгоритмы, структуры данных, шаблоны проектирования, принципы объектно-ориентированного и функционального программирования, чем очередной фреймворк или инструмент.</p><h3>Выгода в долгосрочной перспективе</h3><img src='https://storage.googleapis.com/youit/images/dolgosrochnaya-perspetiva.png' class='image-in-post' alt='Выгода в долгосрочной перспективе' /><p>Важно также осознать и смириться с тем фактом, что от саморазвития вы не получите мгновенной выгоды. Вам вряд ли поднимут зарплату после прочтения книги по шаблонам проектирования или даже после получения сертификата. Однако в долгосрочной перспективе выгода однозначно будет внушительной, которая будет выражена в виде высоких должностей и зарплат, умных коллег, командировок и прочих приятных наград, ради которых стоит сделать самообучение частью своего образа жизни.</p>","Created":{"$date":{"$numberLong":"1576418400000"}},"Description":"Саморазвиваться необходимо правильно. Саморазвитие требует краткосрочного и долгосрочного планов, режима и акцента на фундаментальных знаниях.","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":["5de3a5147dd2f600019789ba"],"Views":{"$numberInt":"153"},"CommentsCount":{"$numberInt":"0"},"Similar":[{"Title":"Джуниор программист с 10 годами опыта. Бред?","Url":"junior-programmer-s-10-godami-opyta-raboty-bred"},{"Title":"Как долго нужно учиться с нуля до должности Trainee Software Engineer","Url":"kak-dolgo-nuzhno-uchitsya-s-nulya-do-dolzhnosti-trainee-software-engineer"}],"Tags":["learning"]}
{"_id":{"$oid":"5df6a069264c0bcdadd3ec33"},"Title":"Современные парадигмы программирования","Url":"sovremennye-paradigmy-programmirovaniya","Text":"<p>Если вы начали интересоваться программированием, то наверняка уже успели встретить такое понятие как “парадигма” или словосочетание “парадигма программирования”. Что именно означает “парадигма” в контексте программирования и какие современные парадигмы существуют сегодня? Давайте разбираться.</p>{ad} <p>Парадигмой является набор устоявшихся идей и принципов, по которым осуществляется проектирование кода компьютерных программ. Парадигма - это определенный способ и направление мышления программиста, которое он использует в разработке. Если объяснить на более простом примере, то представьте себе ученого-физика. Все свои расчеты он выполняет исходя из того, что существует гравитация, то есть можно сказать: “Физик мыслит парадигмой гравитации”. Если физик отправится выполнять свои расчеты в место без гравитации, то ему будет не просто перестроить свое мышление для работы, ведь всю свою карьеру он мыслил исключительно парадигмой гравитации.</p><h3>ООП и ФП</h3><p>На сегодняшний день существуют две ключевые парадигмы в программировании, а именно парадигма объектно-ориентированного программирования и парадигма функционального программирования. Каждая из парадигм включает в себя свои конкретные языки программирования. Например, к объектно-ориентированной парадигме относятся такие языки как C#, Java, C++, а к функциональным - Haskell, Erlang, F#.</p><p>Из двух парадигм нельзя выделить лучшую или худшую. Каждая из парадигм предназначена для решения задач разных типов. Например, для работы с BigData больше подходит функциональная парадигма, а для разработки Enterprise систем - объектно-ориентированная.</p><p>К главным элементам объектно-ориентированных языков программирования относятся следующие:</p><ul><li>Абстракция</li><li>Инкапсуляция</li><li>Наследование</li><li>Полиморфизм</li></ul><p>Главными элементами функциональных языков являются: </p><ul><li>Функции высшего порядка</li><li>Чистые функции</li><li>Рекурсия</li><li>Иммутабельность</li></ul> <p>При использовании объектно-ориентированных языков, программист мыслит понятиями “класс”, “объект” и “метод”, а в функциональных - понятием “функция”. В первом случае программист для реализации задачи проектирует классы, наделяет их поведением в виде методов и продумывает взаимодействие между объектами классов. В случае с функциональными языками, программист проектирует небольшие функции для решения задач и объединяет их в более комплексные механизмы. </p><p>Стоит отметить, что четкого разграничения между двумя парадигмами не существует. Принципы функциональной парадигмы активно применяются и имплементируются в объектно-ориентированных языках программирования, поэтому сегодняшний разработчик скорее занимается так называемым мультипарадигмальным программированием.</p>","Created":{"$date":{"$numberLong":"1576436400000"}},"Description":"Парадигмой является набор устоявшихся идей и принципов, по которым осуществляется проектирование кода компьютерных программ. Парадигма - это определенный способ и направление мышления программиста, которое он использует в разработке.","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":[],"Views":{"$numberInt":"75"},"CommentsCount":{"$numberInt":"0"},"Similar":[{"Title":"Причины появления спагетти-кода","Url":"prichiny-poyavleniya-spagetti-koda"},{"Title":"Простыми словами о понятии Баг в программировании","Url":"prostymi-slovami-o-ponyatii-bag-v-programmirovanii"}],"Tags":["programming"]}
{"_id":{"$oid":"5df9e2b8264c0bcdadd4e43b"},"Title":"Насколько хорошо junior программист должен знать язык программирования","Url":"naskolko-horosho-junior-programmist-dolzhen-znat-yazyk-programmirovaniya","Text":"<p>В изучение какого-либо языка программирования можно погружаться и погружаться до бесконечности.  Для нащупывания некоего подобия дна может потребоваться огромное количество времени, которое измеряется годами. Но всему должен быть <a href='https://youit.pro/post/kak-dolgo-nuzhno-uchitsya-s-nulya-do-dolzhnosti-trainee-software-engineer'>свой предел и свои границы</a>, которые должны варьироваться от целей программиста и ожиданий к нему.</p>{ad}<p>Для начинающих junior программистов, как и для всех остальных, границы обучения языка программирования имеют более-менее четкие очертания, зная которые можно не погрязнуть в бесконечном штудировании учебников, видео-курсов и прочих обучающих источников. Итак, как же можно самостоятельно в домашних условиях определить что вы выучили язык программирования на уровне junior программиста? Давайте разбираться.</p><h3>Выбор книги по языку программирования</h3><img src='https://storage.googleapis.com/youit/images/books.png' class='image-in-post' alt='Книги' /><p>Итак, чтобы ваши знания языка программирования соответствовали знаниям junior разработчика, вам необходимо понимать каждую тему и каждую конструкцию языка, которые описаны в книгах по языка программирования для начинающих. Например, если речь идет о языке C#, то вам подойдет книга <a href=” http://www.albahari.com/nutshell/” target=”_blank”>C# 7.0 in a Nutshell</a> где-то с первой до 17й главы. Если речь о языке JavaScript, то вам подойдет часть №1 онлайн справочника <a href=”https://javascript.info/” target=”_blank”> javascript.info</a>. Если вы учите другие языки программирования то воспользуйтесь помощью Google для поиска необходимой вам книги сформировав запрос следующим образом:</p><p><i>“Книга по <ваш язык программирования здесь> для начинающих”</i></p><p>Но теперь у вас может возникнуть другой вопрос: насколько глубоко необходимо знать каждую из тему/каждую программную конструкцию языка программирования, описанную в учебнике? Например, если речь идет о функциях, то достаточно ли знать только их синтаксис? Или необходимо также иметь общее понимание о структуре машинного кода, в который функции компилируются? Если речь идет о делегатах, то достаточно ли просто знать, что это такое? Или необходимо уметь реализовать делегат самостоятельно при помощи набора примитивных программных конструкций?</p><h3>Контрольные вопросы для проверки знаний</h3><p>Чтобы упростить вам задачу, мы сформировали для вас несколько контрольных вопросов, которые вы должны задать себе (или попросить друга задать их вам) после каждой пройденной темы языка программирования. Если ответы даны, то вы знаете язык так, как его должен знать junior программист.</p><p>Итак, выберете любую конструкцию языка, например статические классы. После чего ответьте для себя на четыре следующих вопроса:</p><ul><li><u>Что такое</u> статические классы?</li><li><u>Для чего применяются</u>  статические классы?</li><li> <u>Существуют ли альтернативы</u>  статическим классам?</li><li> <u>Как выглядит синтаксис создания и работы</u> со статическими классами?</li></ul><p>Ваши ответы определенно не должны занимать страницу текста, наоборот они должны быть короткими и четко формулировать идею. Например, ответ на первый вопрос может звучать так: </p><p><i>“Статические классы это такие классы которые содержат в себе статические методы и свойства, которые могут быть вызваны напрямую через имя класса, без создания объекта”.</i></p><p>Ответ на второй вопрос может быть таким: </p><p><i>“Статические классы применяются когда необходимо создать класс не имеющий состояния, например для хранения данных конфигурационного файла.</i></p> <p>Ответ на третий вопрос: </p> <p><i>“Альтернативой статическим классам могут являться обычные экземплярные классы”.</i></p><p>И в случае с четвертым вопросом, вы просто должны знать синтаксис создания статического класса и вызова его методов и свойств в зависимости от выбранного вами языка программирования.</p><p>Каждый из вышеперечисленных четырех фундаментальных вопросов <i>“Что такое…”, “Для чего применяются…”, “Существуют ли альтернативы…”, “Как выглядит синтаксис создания и работы…”</i>  вы должны задать себе на каждую тему/конструкцию изучаемого вами языка программирования, такие как переменные, константы, строки, условия, циклы, методы, классы, интерфейсы, делегаты, события, сборки и так далее. Как только вы сможете уверенно отвечать на четыре вопроса для всех тем выбранного вами учебника - вы знаете язык программирования на уровне <a href='https://youit.pro/post/v-chem-raznitsa-mezhdu-junior-middle-i-senior-programmistami'>junior программиста</a>.</p>","Created":{"$date":{"$numberLong":"1576699200000"}},"Description":"Для того чтобы junior программист понял достаточно хорошо ли он выучил язык программирования, достаточно задать себе четыре контрольных вопроса.","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Views":{"$numberInt":"151"},"CommentsCount":{"$numberInt":"0"},"Similar":[{"Title":"Джуниор программист с 10 годами опыта. Бред?","Url":"junior-programmer-s-10-godami-opyta-raboty-bred"},{"Title":"Junior developer, повышаем твои шансы на прохождение собеседования","Url":"junior-developer-povishayem-tvoi-shansy-na-prokhozhdeniye-sobesedovaniya"},{"Title":"Как найти работу программиста без опыта?","Url":"kak-programmistu-bez-opyta-nayti-rabotu"}],"Tags":["learning","programming","junior"]}
{"_id":{"$oid":"5dfb98f5264c0bcdadd56ef9"},"Title":"Мысли вслух о творчестве в программировании","Url":"mysli-vslukh-o-tvorchestve-v-programmirovanii","Text":"<p>Существует утверждение, что программирование относится к категории творческих профессий, а <a href='/post/pishut-li-programmisty-kod'>процесс написания кода</a> по количеству творчества в нем схож с написанием пейзажей или рекламных лозунгов. Реальность заключается в том, что доля творчества в программировании действительно присутствует, однако она крайне мала и постепенно уменьшается по мере развития IT-индустрии и в конце концов может вовсе раствориться. Хорошо это или плохо и почему так происходит давайте разбираться.</p>{ad}<p>Творчество в программировании - это возможность находить и реализовывать нестандартные решения, которые еще нигде не были задокументированы ранее. Когда программист встречается с некоторой задачей в программировании то у него есть два пути. Путь номер один - это провести исследование с целью нахождения готового решения своей задачи. Искать можно в книгах, официальной документации и других профессиональных источниках. Путь номер два - это придумать свое собственное решение задачи. Процесс номер один практически полностью исключает из работы творчество, за исключением того маленького этапа, когда программист адаптирует найденное стандартное решение под свой конкретный случай. Процесс номер два является действительно творческим, что определенно радует правое полушарие программиста.</p><img src='https://storage.googleapis.com/youit/images/programmirovanie-za-stolom.png' class='image-in-post' alt='Программирование за столом возле окна' /><p>Какой же из двух процессов лучше? Творческий подход действительно уместен в некоторых случаях, например при возникновении реально сложных задач, которые еще не были никем решены. Однако на сегодняшний день появление таких задач скорее является исключением из правил, так как IT-индустрия активно развивается, документируются принципы, правила, рекомендации и шаблоны для решения тысяч и тысяч задач которые могут всплыть. Связь между уровнем развития IT и творчеством в нем является обратно пропорциональной - чем больше развито IT, тем меньше места для творчества в нем остается. Как результат, по состоянию на сегодняшний день необходимость изобретать велосипед появляется совсем не часто.</p><p>То творчество которое можно встретить в современной разработке часто звучит в негативном контексте. Ведь большой процент программистов хотят решать задачи творчески, однако только у небольшой части программистов творческие решения получаются действительно достойными. Большая часть творческих решений имеют крайне низкое качество. А если даже и с качеством все в порядке, то код решения может быть <a href='/post/prichiny-poyavleniya-spagetti-koda'>крайне громоздким и запутанным</a> для коллег по команде.</p><p>Активное творчество как правило свойственно начинающим программистам, которые еще не успели изучить толстые тома документации и пытаются решить задачу своими силами. Однако как правило такие решения бракуются старшими программистами на code review и впоследствии код полностью переписывается в соответствии со стандартами разработки.</p><p>Как видим, творчество в программировании действительно уместно далеко не в повседневной работе. Регулярное творчество от программиста как правило говорит либо о его неопытности, либо о простой нехватке времени на поиск существующего задокументированного решения.</p>","Created":{"$date":{"$numberLong":"1576756800000"}},"Description":"Существует утверждение, что программирование относится к категории творческих профессий, а процесс написания кода по количеству творчества в нем схож с написанием пейзажей или рекламных лозунгов. Так это или нет?","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Views":{"$numberInt":"63"},"CommentsCount":{"$numberInt":"0"},"Similar":[{"Title":"Программист-блогер: зачем программисту вести свой блог?","Url":"programmist-blogger-zachem-programmistu-vesti-svoj-blog"},{"Title":"Cленг программистов в IT","Url":"sleng-programmistov-v-it"}],"Tags":["programming"]}
{"_id":{"$oid":"5dfba455264c0bcdadd574b6"},"Title":"Что необходимо минимально знать каждому хорошему программисту?","Url":"chto-dolzhen-minimalno-znat-kazhdyj-khoroshij-programmist","Text":"<p>Задумывались ли вы что отличает рядового программиста от хорошего программиста? Кто-то скажет, что хороший программист должен углубленно владеть своим основным языком программирования. Кто-то скажет про способность быстро и в срок выполнять поставленные задачи. Кто-то увяжет крутость программиста только с количеством языков программирования, фреймворков и библиотек, которыми тот владеет. Все эти утверждения с одной стороны имеют свою долю правды, но с другой стороны каждое из них может быть без проблем оспорено.</p>{ad}<p>Cуществует еще один интересный критерий, который отличает хорошего программиста от рядового. И с корректностью этого критерия соглашаются большинство опытных программистов. Он звучит следующим образом:</p> <p class='cite'>“Хороший программист это тот программист, который твердо владеет фундаментальными знаниями.”</p> <p>К разряду фундаментальных относятся такие знания, которые не устаревают с течением времени и на базы которых создаются десятки различных инструментов для разработки программного обеспечения. Следовательно, фундаментальные знания не имеют границ в виде языков программирования и технологий, либо эти границы достаточно широки.</p><p>Давайте взглянем на перечень таких фундаментальных знаний, которые являются важными для каждого без исключения программиста, вне зависимости от его специализации и предпочтений.</p><h3>Структуры данных и Алгоритмы</h3><p>Важно понимать принципы построения и работы таких структур данных как Массив (Array), Стек (Stack), Очередь (Queue), Cписок (List), Хеш-таблица (Hashtable), Дерево (Tree), Граф (Graph). Необходимо ориентироваться в различных подвидах перечисленных структур. Например, не помешает знать, что списки существуют односвязные и двусвязные, а графы бывают ориентированные и неориентированные. Также знать когда и какую структуру данных или ее подвид необходимо использовать для самого оптимального выполнения решаемой задачи.</p><p>К основным алгоритмам, которые необходимо понимать всем программистам, относятся линейный поиск, бинарный поиск, быстрая сортировка, сортировка слиянием, поиск в глубину и в ширину. Необходимо знать основные битовые операции, уметь писать рекурсивные алгоритмы. Также необходимо понимать Big O нотацию и знать разницу между O(1), O(log n), O(n), O(n квадрат 2).</p><p>Хорошее знание <a href='https://www.coursera.org/specializations/data-structures-algorithms' target='_blank'>алгоритмов и структур данных</a> позволит вам уверенно решать задачи, опираясь на проверенные десятилетиями решения. Вам код будет лаконичен и легко читаемым (для тех кто также знает алгоритмы), а его быстродействие может в десятки раз превосходить код, написанный программистом без знания алгоритмов и структур данных.</p><h3>Принципы ООП и ФП</h3><p>Владение принципами объектно-ориентированного программирования или ООП сложно переоценить. Абстракция, Инкапсуляция, Наследование и Полиморфизм. Четыре принципа которые хороший программист должен уметь легко разъяснить любому встречному человеку (не обязательно техническому) без долгих раздумий и сомнений. Помимо этих принципов, также необходимо понимать разницу между агрегацией и композицией, знать принципы сильного сцепления (High Cohesion) и слабой связанности (Low coupling), а также принцип Модульности (Modularity).</p><p>Понимание принципов функционального программирования необходимо даже тем программистам, которые планируют всю свою жизнь использовать исключительно объектно-ориентированные языки. По состоянию на сегодняшний день, немалое количество принципов функционального программирования, такие как чистые функции, неизменяемость или функции высшего порядка могут легко быть имплементированы программистом в языках <a href='/post/sovremennye-paradigmy-programmirovaniya' target='_blank'>объектно-ориентированной парадигмы</a>, что сделает код более читабельным, эффективным и легко расширяемым.</p><h3>SOLID и шаблоны проектирования</h3><p>Принципы SOLID чрезвычайно важны, так как их знание позволяет значительно сузить количество неправильных способов проектирования программного кода. Аббревиатура SOLID используется для обозначения пяти принципов проектирования программных систем, таких как принцип единой ответственности, принцип открыт/закрыт, принцип подстановки Лисков, принцип разделения интерфейсов и принцип инверсии зависимостей.</p><p>Шаблоны проектирования решают ту же проблему, что и принципы SOLID – направляют программиста в правильную сторону при проектировании кода. Из огромного количества существующих шаблонов в первую очередь можно выделить те 23 шаблона, которые были впервые описаны в книге банды четырех. Многие из этих шаблонов повсеместно применяются при разработке ПО. Знание шаблонов как и знание алгоритмов позволяет не изобретать велосипед при написании кода. Также шаблоны дают программистам возможность общаться между собой на “одном языке”. К ключевым шаблонам, которыми точно необходимо владеть, можно отнести следующие:</p><ul><li>Синглтон</li><li>Фабричный метод</li><li>Адаптер</li><li>Прокси</li><li>Стратегия</li><li>Декоратор</li><li>Фасад</li></ul><h3>Выводы</h3><p>Все вышеизложенные темы являются фундаментом для изучения большого количества всевозможных языков программирования, принципов работы фреймворков, архитектурных шаблонов, шаблонов корпоративных приложений и многого другого. Поэтому всегда в свободное время отдавайте предпочтение изучению фундаментального материала, вместо очередного фреймворка. В долгосрочной перспективе вы точно останетесь в выигрыше.</p>","Created":{"$date":{"$numberLong":"1576756860000"}},"Description":"Задумывались ли вы что отличает рядового программиста от хорошего программиста? Углубленное владение языком программирования? Знание фреймворков? Наличие фундаментальных знаний?","Type":{"$numberInt":"1"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Views":{"$numberInt":"125"},"CommentsCount":{"$numberInt":"0"},"Similar":[{"Title":"Не дается обучение программированию?","Url":"ne-dayetsya-obucheniye-programmirovaniyu"},{"Title":"Junior C#! Не иди на собеседование, если не знаешь ответов на такие вопросы","Url":"junior-csharp-ne-idi-na-sobesedovaniye-esli-ne-znayesh-otvetov-na-takiye-voprosy"}],"Tags":["learning","programming","algorithms","oop"]}
{"_id":{"$oid":"5dfd14e8264c0bcdadd5deec"},"Title":"Что такое Hello World в программировании?","Url":"hello-world-v-programmirovanii","Text":"<p>Hello World - это не вступительная фраза президента США на генассамблее ООН и не первое обращение инопланетян к землянам в фильме “День независимости”. Hello World - это первая программа каждого программиста, которую они пишут в самом начале своего обучения. Как правило, ни один план обучения в компьютерных академиях не обходится без написания Hello World’а.</p>{ad}<p>Традиция писать Hello World в качестве первой программы зародилась еще в 70х годах прошлого века и с тех пор прочно укоренилась во всех учебниках программирования и планах обучения в независимости от языка и специализации. Смысл программы Hello World заключается в том, что в окно программы при запуске выводится всего лишь единственное сообщение ‘Hello World’. И на этом все. Какая либо иная функциональность в программе отсутствует. Безусловно, такая программа является самой простой программой из всех возможных. Она состоит всего из одной единственной команды вывода текста в консоль и самой строки (строкового литерала).</p><p>Вот как выглядит код программы “Hello World” на самых популярных языках программирования:</p><table class='two-cols'><tr><th>Язык</th><th>Реализация</th></tr><tr><td>C#</td><td>Console.WriteLine(“Hello World!”);</td></tr><tr><td>Java</td><td>System.out.println(&quot;Hello World!&quot;);</td></tr><tr><td>JavaScript</td><td>alert(&quot;Hello World!&quot;);</td></tr><tr><td>Python</td><td>print(&quot;Hello World!&quot;) </td></tr><tr><td>Ruby</td><td>puts &quot;Hello World!&quot;</td></tr><tr><td>Go</td><td>fmt.Println(&quot;Hello World!&quot;);</td></tr><tr><td>C++</td><td>cout << “Hello World!”;</td></tr></table><p>По причине примитивности программы Hello World, программисты часто используют ее в своих разговорах, когда нужно дать понять, что поставленная задача является очень простой, например:</p><p class='cite'>“Я сделаю валидацию данных за пять минут, это не сложнее Hello World”.</p><p>или</p> <p class='cite'>“Я ухожу с этого проекта, мне уже надоело решать задачи уровня Hello World”.</p><p>Предлагаем вам прямо сейчас самостоятельно написать Hello World, если вы еще этого не сделали. Это будет очень просто и забавно.</p>","Created":{"$date":{"$numberLong":"1573416000000"}},"Description":"Что такое Hello World в программировании?","Type":{"$numberInt":"1"},"Views":{"$numberInt":"108"},"CommentsCount":{"$numberInt":"0"},"WhoDisliked":[],"WhoLiked":[],"Tags":["programming"]}
{"_id":{"$oid":"5dfd1f16264c0bcdadd5e44f"},"Title":"Что такое Энтерпрайз разработка?","Url":"сhto-takoe-enterprajz-razrabotka","Text":"<p>Одним из востребованных направлений разработки программного обеспечения на сегодняшний день является Энтерпрайз разработка. Слово Энтерпрайз может встретиться в описании вакансии на LinkedIn или при прохождении собеседования в IT-компанию. Однако несмотря на распространенность данного термина и обильное его употребление в устной речи, не все понимают понятие Энтерпрайза одинаково. Давайте разбираться что к чему.</p>{ad}<p>Для одних Энтерпрайз разработка означает работать на проектах с огромной кодовой базой. Для других Энтерпрайз означает работу обязательно с унаследованными системами. Для кого-то еще Энтерпрайз означает разработку программного обеспечения для больших корпораций. Каждое из перечисленных определений может быть увязано с термином Энтерпрайз. Однако, ни одно определение не является точным и не дает полного представления об Энтерпрайз разработке.</p><p class='read-also'>Читайте также: <a href='/post/kak-popast-v-it-kompaniyu-ne-programmistom'>Как попасть в IT компанию не программистом</a></p><h3>Энтерпрайз разработка и кровь</h3><p>Вот более точное определение Энтерпрайз разработки - Энтерпрайз разработка означает разработку программного обеспечения, предназначенного для частичной либо полной автоматизации бизнес процессов некоторой компании. К примерам Энтерпрайз проектов можно отнести банковские системы, CRM системы и другие.</p> <img src='https://storage.googleapis.com/youit/images/krovavyj-enterprajz.png' class='image-in-post' alt='Кровавый Энтерпрайз' /><p>Иногда можно услышать такое выражение как Кровавый Энтерпрайз. Такое название сформировалось по той причине, что в коде Энтерпрайз проектов зачастую &quot;без бутылки не разобраться&quot;. Местами сложный, запутанный и неподатливый к изменениям код является следствием того, что Энтерпрайз проекты разрабатываются годами, одни программисты сменяются другими, а потом третьими и так далее. В результате отсутствует человек, который бы владел полным концептуальным видением проекта и при этом контролировал выполнение работ. В итоге Энтерпрайз проекты могут <a href='/post/prichiny-poyavleniya-spagetti-koda'>смешивать в себе различные стили программирования</a>, инструменты и техники, некоторые из которых могут быть даже взаимоисключающими.</p><h3>Бесконечная разработка</h3><p>Теперь у вас мог созреть резонный вопрос. Почему Энтерпрайз проект нельзя один раз написать, отдать заказчику и больше к его разработке не возвращаться? Дело в том, что как уже упоминалось раньше, Энтерпрайз проекты автоматизируют бизнес-процессы компании, для которой они разрабатываются. И если вдруг в мире бизнеса происходят какое-то изменения (а они происходят регулярно), то их нужно немедленно реализовать в программном продукте. Простой пример: если банк вводит новый тип платежных карт, то этот тип карт должен быть доступен в банковском аккаунте пользователя. А значит необходимы как минимум программисты, которые эти платежные карты добавят в систему в интерфейс пользователя (UI), бизнес-логику приложения и базу данных. Также нужны тестировщики, которые протестируют новый функционал на корректность работы в соответствии с требованиями заказчика.</p><p class='cite'>Непрерывные изменения бизнеса влекут за собой непрерывные изменения в Энтерпрайз проекте, так как проект описывает бизнес-модели и реализует протекаемые в бизнесе процессы.</p><p> Однако несмотря на то, что Энтерпрайз он кровавый, не бойтесь его. На сегодняшний день существует огромное количество техник, правил, рекомендаций и инструментов, позволяющих успешно разрабатывать Энтерпрайз проекты, сопровождать и “реанимировать” их в случае необходимости.</p>","Created":{"$date":{"$numberLong":"1576861200000"}},"Description":"Одним из востребованных направлений разработки программного обеспечения на сегодняшний день является Энтерпрайз разработка. Но что конкретно означает понятие Энтерпрайз?","Type":{"$numberInt":"1"},"Views":{"$numberInt":"110"},"CommentsCount":{"$numberInt":"0"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Similar":[{"Title":"Мысли вслух о творчестве в программировании","Url":"mysli-vslukh-o-tvorchestve-v-programmirovanii"},{"Title":"Как попасть в IT компанию не программистом?","Url":"kak-popast-v-it-kompaniyu-ne-programmistom"},{"Title":"Какой тип IT-компании выбрать программисту?","Url":"kakoy-tip-it-kompanii-vybrat-programmistu"}],"Tags":["programming","enterprise"]}
{"_id":{"$oid":"5dff61c9264c0bcdadd6a015"},"Title":"Карьерный путь программиста от Трейни до Архитектора","Url":"karernyj-put-programmista-ot-trejn-do-arkhitektora","Text":"<p>Сегодня IT-сфера развивается достаточно активно. Одним из показателей такого бурного роста, помимо бесчисленного количества инструментов разработки или языков программирования, является немалое количество возможных технических должностей и возможных направлений карьерного роста. Давайте разберём один возможных и достаточно распространенных путей развития программиста.</p>{ad}<p>Первая ступень программиста - это должность Trainee Software Engineer. Программист уровня Trainee обычно не имеет никакого коммерческого опыта разработки, но уже имеет неплохие теоретические знания языка программирования и сопутствующих технологий, фреймворков, библиотек. До своего первого повышения по карьерной лестнице, Trainee программист работает в среднем от трех до шести месяцев под пристальным контролем старших коллег.</p><p class='read-also'>Читайте также: <a href=' /post/kak-programmistu-pravilno-samorazvivatsya'> Как программисту правильно саморазвиваться?</a></p><p>Вторая ступень - должность Junior Software Engineer. Джуниоры уже обладают небольшим опытом коммерческой разработки обычно от полугода до двух лет. Они имеют неплохое понимание простых шаблонов написания кода (Фабрики, Одиночки, Строители), знакомы с процессом разработки программного обеспечения и выполняют сложную работу под присмотром старших коллег. Однако джуниоры уже могут выполнять немало не сложных задач самостоятельно, пусть и с постоянно присутствующими сомнениями в правильности решения. На своей должности джуниор программисты в среднем работают два-три года до повышения последующего повышения.</p><img src='https://storage.googleapis.com/youit/images/karernaya-lestnica.png' class='image-in-post' alt='Карьерная лестница программистов' /><p>Третья ступень - должность Middle Software Engineer или же как следует из названия - “середнячок”. В практическом плане мидлы уже самостоятельно могут разрабатывать отдельные фрагменты системы, за исключением чего-то большого и сложного, как например создание проекта с нуля. В теоретическом плане мидлы уже хорошо знают и применяют шаблоны проектирования, хорошо понимают основные алгоритмы и структуры данных, умеют применять многопоточность и асинхронность, могут выполнить большой рефакторинг, выходящий за рамки одного класса. На своей должности мидл программист в среднем работает два-три года до очередного повышения.</p><p>Четвертая ступень - должность Senior Software Engineer. Синьйоры уже являются достаточно матерыми программистами, которые могут разрабатывать сложные части системы, твердо обосновывать принятые решения и контролировать выполнение работы младшими коллегами. Зачастую синьоры программисты сознательно завершают движение по карьерной лестнице на своей должности. Они лишь продолжают совершенствовать свое мастерство в разработке ПО и изучать смежные направления для расширения своего кругозора или так называемого “роста в ширину”. Но при желании получить следующую должность, необходимо иметь до семи лет суммарного опыта разработки.</p><p>Пятая ступень - должность Technical Leader. Технический лидер - это человек, который руководит всей технической частью разработки проектов. Часто технический лидер исполняет роль такого себе универсального солдата, который может и функционал реализовать, и критический дефект исправить, и распределить задачи между командой, и выполненную проверить работу. На данной должности можно остановиться, как и в случае с синьорами, но если хочется идти дальше, то требуется около десяти лет суммарного опыта в разработке.</p><p>Шестая ступень - Architect. Задача архитектора заключается в создании архитектуры проекта, которой предшествует тщательный анализ функциональных и нефункциональных требований заказчика. Причем если программист в процессе своей работы производит код, то результатом работы архитектора часто является текстовый документ с набором диаграмм и рекомендаций, которые в последствии являются инструкцией для технических лидеров и синьйоров по имплементации проекта.</p>","Created":{"$date":{"$numberLong":"1577001600000"}},"Description":"Сегодня IT-сфера развивается достаточно активно. Одним из показателей такого бурного роста, помимо бесчисленного количества инструментов разработки или языков программирования, является немалое количество возможных технических должностей и возможных направлений карьерного роста.","Type":{"$numberInt":"1"},"Views":{"$numberInt":"159"},"CommentsCount":{"$numberInt":"0"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Similar":[{"Title":"Не дается обучение программированию?","Url":"ne-dayetsya-obucheniye-programmirovaniyu"},{"Title":"Насколько хорошо junior программист должен знать язык программирования","Url":"naskolko-horosho-junior-programmist-dolzhen-znat-yazyk-programmirovaniya"},{"Title":"Джуниор программист с 10 годами опыта. Бред?","Url":"junior-programmer-s-10-godami-opyta-raboty-bred"}],"Tags":["carrier"]}
{"_id":{"$oid":"5e035feb264c0bcdadd7bfe2"},"Title":"Карта знаний .NET Web программиста","Url":"dotnetweb","Text":"<p>На сегодняшний день наука разработки программного обеспечения состоит из такого большого количества тем, что сориентироваться в них трудно даже опытному программисту, не говоря уже о новичках. Именно по этой причине мы начали разработку серии <a href='/map'>“Карт знаний”</a> для программистов, которые самым детальным образом описывают все, что должны знать как новички, так и синьоры. Первым результатом нашей работы стала <a href='/map/dotnetweb'>Карта знаний .NET Web программиста</a>, которая включает в себя около 20 следующих тем: </p><ul><li>Язык программирования C#</li><li>.NET Framework / .NET Core</li><li>Контроль качества кода / Рефакторинг</li><li>Многопоточность и Асинхронное программирование</li><li>Модульное и интеграционное тестирование</li><li>Алгоритмы и Структуры Данных</li><li>Принципы объектно-ориентированного программирования (ООП) </li><li>Шаблоны и принципы проектирования, SOLID</li><li>Предметно-ориентированное проектирование (Domain-driven design, DDD) </li><li>Шаблоны уровня доступа к данным</li><li>Фреймворки доступа к данным: Entity Framework, NHibernate, Dapper</li><li>Архитектурные шаблоны и Атрибуты качества (Quality Attributes) </li><li>HTTP, REST, Веб-фреймворки: ASP.NET MVC / Web API / Core</li><li>Фронтенд разработка: JavaScript / TypeScript / SPA фреймворки</li><li>Веб-безопасность, Шифрование данных, OWASP</li><li>Распределенные системы и Микросервисная архитектура</li><li>Базы данных: T-SQL, MS SQL, NoSQL</li><li>Системы контроля версий: Git, Mercurial, TFS</li><li>Методологии разработки: Scrum, Kanban и Scrumban</li></ul><p><a href='/map/dotnetweb'>Пользуйтесь картой</a> в целях самообучения, поиска пробелов в знаниях, создания программ обучения, подготовки к собеседованиям и продвижениям по карьерной лестнице.</p> <p>Не забывайте делиться с нами своими впечатлениями, пожеланиями или рекомендациями по улучшению в комментариях или на электронный адрес <a href='mailto:admin@youit.pro'>admin@youit.pro</a>.</p> <p>Счастливого обучения!</p>","Created":{"$date":{"$numberLong":"1577304000000"}},"Description":"Детализированная карта знаний для .NET Web программистов от Trainee до Senior. Используйте для самообучения, поиска пробелов в знаниях, создания программ обучения, подготовки к собеседованиям и продвижениям по карьерной лестнице.","Type":{"$numberInt":"1"},"Views":{"$numberInt":"163"},"CommentsCount":{"$numberInt":"3"},"WhoDisliked":[],"WhoLiked":["5de3a5147dd2f600019789ba","5ddfa425048adc0001295115","5ddfe9e6048adc000129511e"],"Tags":["dotnet","csharp","oop","quality","testing","algorithms","js"]}
{"_id":{"$oid":"5e07417f264c0bcdadd92712"},"Title":"Как программисту писать качественный код, следуя лишь одному правилу","Url":"kak-programmistu-pisat-kachestvennyj-kod","Text":"<p>Любой современный язык программирования, будь то JavaScript, Python или C# является достаточно комплексным инструментом, который состоит из длинного списка простых и сложных составляющих. Даже небольшая задача может быть решена несколькими разными способами за счет вариаций комбинирования программных конструкций.</p>{ad}<p>Но только лишь на сложности языков программирования разговор не оканчивается. Никуда не деться от естественной сложности современных программных систем, которые могут включать в себя тысячи бизнес-правил, взаимодействие с различными хранилищами данных, интеграцию с десятками внешних систем, интерактивный дизайн и так далее. Если умножить сложность языков программирования и фреймворков на естественную сложность программных систем, в итоге получаем такого монстра, который может выйти из-под контроля в любую секунду.</p><h3>Техники борьбы со сложностью</h3><p>Для борьбы с естественной сложностью разрабатываемых программных систем уже давно существуют такие вещи как принципы объектно-ориентированного программирования, объектно-ориентированный дизайн и предметно-ориентированное проектирование. Если следовать им грамотно и без чрезмерного фанатизма, то они действительно помогают программным системам не превратиться в большой ком грязи в конечном итоге. Если говорить конкретнее, то к таким принципам относятся следующие: SOLID, Модульность, Принцип слабого сцепления/сильной связанности, Принцип инверсии зависимостей и другие.</p><p>На вышеперечисленных принципах построен длинный ряд шаблонов проектирования, к которым относятся GoF шаблоны (Декоратор, Медиатор, Посетитель и так до 23х), не GoF шаблоны (Null Object, Rules, Event Aggregator), шаблоны доступа к данным (Репозиторий, Единица работы, Спецификация, Активная запись…), шаблоны предметно-ориентированного проектирования (Сущность, Объект-значение, Доменный сервис, Агрегат, Репозиторий, Доменное событие) и прочие категории шаблонов.</p><p>Если все это добро просуммировать, то наверное получится не меньше сотни различных инструментов проектирования, подчинить которые своему уму можно только после очень долгого обучения и регулярной практике.</p><h3>Все производное от Принципа Единой Ответственности</h3><p>Если проанализировать различные принципы, шаблоны и анти-шаблоны проектирования, то немалую их часть объединяет лишь один принцип, а именно Принцип Единой Ответственности (Single Responsibility Principle). Наверное, не зря он стоит на первом месте в списке SOLID. Этот принцип говорит о том, что программный компонент (метод, класс, интерфейс, сборка, микросервис) должен реализовывать только одну задачу и иметь только одну причину для внесения в него изменения.</p><p>На принципе единой ответственности базируются например Принцип Открыт/Закрыт (Open/Closed Principle) или Принцип Разделения Интерфейсов (Interface Segregation Principle), так как следование им является следованием принципу единой ответственности в чистом виде.</p><p>На принципе единой ответственности базируется большая часть шаблонов проектирования, которые созданы именно для его соблюдения, а именно Строитель/Фабричный метод, Декоратор, Прокси, Цепочка обязанностей, Итератор, Медиатор, Состояние, Стратегия/Шаблонный метод, Правила (Rules), MVC и другие. Все перечисленные шаблоны инкапсулируют логику определенного вида. Например, шаблон Медиатор инкапсулирует логику взаимодействия нескольких объектов. Если не использовать Медиатор, то логика взаимодействия располагалась бы непосредственно во взаимодействующих между собой объектах в добавок к их основной логике, что и нарушало бы принцип единой ответственности.</p><p>Ну и наконец различные анти-шаблоны, как например God-object, слезно кричат лишь об одном: “Не нарушайте принцип единой ответственности!”.</p><h3>Как следовать Принципу Единой Ответственности</h3><p>Следовать Принципу Единой Ответственности совсем не сложно с технической точки зрения, ведь как упоминалось ранее, вы, как разработчик, должны наделять свои программные компоненты (методы, классы и т. д.) единственной обязанностью. Например,  метод не должен выполнять валидацию данных и сохранять их в базу, а класс не должен вычислять значения по некоторым формулам и генерировать pdf-документы.</p><p>В следовании принципу единой ответственности главную роль играет выбор вами четкого именования методов, классов и т. д. Имя должно четко описывать выполняемую обязанность, должно описываться одним-тремя словами и не содержать союзов ‘И’ или ‘Или’ (например, OrderPriceCalculator а не OrderPriceCalculatorAndXmlParser). Имя должно быть неким сдерживающим фактором для программиста, чтобы не впихнуть новые обязанности, которые будут выходить за рамки выбранного имени. Если, например, называть свои классы Helper, Manager, Doer, то в конечном счете в них окажется самая разнообразная логика и принцип единой ответственности будет нарушен. Но если класс будет называться например XmlFileValidator, то вряд ли у кого-то поднимется рука разместить там логику расчета налогов или стоимости заказа.</p><h3>Заключение</h3><p>Итоги очень просты – следуйте принципу единой ответственности, сделайте это своим главным приоритетом. Благодаря этому, в вашем коде начнут вырисовываться самые разнообразные шаблоны проектирования, с которыми вы даже еще не успели познакомиться.</p>","Created":{"$date":{"$numberLong":"1577527200000"}},"Description":"Ваш код может быть достаточно качественным, если следовать лишь одному принципу - Принципу Единой Ответственности.","Type":{"$numberInt":"2"},"Views":{"$numberInt":"91"},"CommentsCount":{"$numberInt":"0"},"WhoDisliked":[],"WhoLiked":["5ddfa425048adc0001295115"],"Similar":[{"Title":"Пишут ли программисты код?","Url":"pishut-li-programmisty-kod"},{"Title":"Причины появления спагетти-кода","Url":"prichiny-poyavleniya-spagetti-koda"},{"Title":"Нужны ли программисту сертификаты?","Url":"nuzhny-li-programmistu-sertifikaty"}],"Tags":["oop","quality"]}
{"_id":{"$oid":"5e0a29d1264c0bcdadda50ee"},"Title":"О проблеме эстимейтов в разработке программных продуктов","Url":"o-probleme-estimejtov","Text":"<p>При разработке программного обеспечения постоянно возникает необходимость давать эстимейты или эстимации (estimates), то есть оценку времени работ. Оценку приблизительного времени работы выполняет непосредственно программист в простых человеко-часах или в относительных величинах Story Points. Полученные цифры используют, например, для планирования спринтов или подбора исполнителей на проект.</p>   <p>Эстимейты в разработке ПО обладают одним недостатком: они редко когда бывают точными, и не могут в разы расходиться с фактическим временем выполненной работы. Даже существует утверждение, смысл которого в том, что точный эстимейт для некоторой задачи можно дать тогда и только тогда, когда работа над этой самой задачей уже завершена.</p><h3>Классификация работ</h3><p>Для того чтобы глубже понять проблему эстимейтов, сначала необходимо классифицировать работу программистов на несколько категорий. Каждый вид работ имеет свою сложность при проставлении эстимейтов.</p><p><b>Вид №1 - Разработка нового функционала</b></p><p>Разработка нового функционала (конечно же при условии полных и непротиворечивых требований заказчика) является наверное самым благоприятным случаем для более-менее точного эстимейта. И здесь обычно <a href='post/junior-programmer-s-10-godami-opyta-raboty-bred'>чем опытнее программист</a>, тем более точным будет его эстимейт. Если же программист серьезно просчитывается, то это обычно говорит о его неопытности и чрезмерном оптимизме, чем о проблеме самих эстимейтов.</p><p><b>Вид №2 - Разработка нового функционала и его интеграция с существующей системой</b></p><p>Тут для предоставления точного эстимейта вначале программисту требуется достаточное количество времени на изучение интерфейса той системы, с которой ему необходимо интегрироваться. Если программисту такого времени не предоставляют или оно ограничено – эстимейт будет далеким от истины, так как не будет учитывать особенностей внешней системы.</p><p><b>Вид №3 - Расширение существующего функционала</b></p><p>Проблема аналогична предыдущему примеру, так как снова программисту необходимо достаточное количество времени на изучение того функционала, который он планирует расширять или модифицировать. Если время на его полное и тщательное изучение отсутствует – то реалистичного эстимейта не получится.</p><p><b>Вид №4 – Исправление дефектов в собственном функционале</b></p><p>Если опытному программисту приходится исправлять дефекты или багфиксить в собственном “авторском” функционале, то имеются все предпосылки для реалистичного эстимейта. Ведь если программист разрабатывал некоторый функционал, то он хорошо знаком со всеми деталями его реализации. Следовательно, программист имеет большие шансы на быстро и без долгого анализа понять причину бага, чего обычно достаточно для реалистичного эстимейта.</p><p><b>Вид №5 - Исправление дефектов в унаследованном коде</b></p><p><a href='/post/prostymi-slovami-o-ponyatii-bag-v-programmirovanii'>Дефекты в унаследованном или просто чужом коде</a> не эстимируются вовсе до момента, пока не установлена их причина. Это как с поломкой машины. Если она заглохла, то пока вы как минимум не заглянете под капот, вы не скажете сколько вам потребуется времени на исправление поломки.</p><p class='cite'>Программист должен давать эстимейты своим менеджерам или заказчикам на дефекта в унаследованном коде только после его предварительного анализа. В противном случае эстимейт будет не эстимейтом, а ничем не подкрепленным предположением.</p><p>Помните о том, что вы всегда должны заглянуть под капот.  Доносите это до всех тех людей, включая не техничных заказчиков и менеджеров, которые требуют от вас эстимейта здесь и сейчас. </p><p><i>P.S. Наверное, фундаментальна проблема эстимейтов заключается в самом названии. Если термин “эстимейт” (estimate - оценка) переименовать на более подходящий термин “прогноз” (forecast), то общее положение дел в разработке ПО станет чуть лучше.</i></p>","Created":{"$date":{"$numberLong":"1569837600000"}},"Description":"При разработке программного обеспечения постоянно возникает необходимость давать эстимейты или эстимации (estimates), то есть оценку времени работ.","Type":{"$numberInt":"2"},"Views":{"$numberInt":"91"},"CommentsCount":{"$numberInt":"0"},"WhoDisliked":[],"WhoLiked":[],"Similar":[{"Title":"Как программисту писать качественный код, следуя лишь одному правилу","Url":"kak-programmistu-pisat-kachestvennyj-kod"},{"Title":"Как программисту правильно саморазвиваться?","Url":"kak-programmistu-pravilno-samorazvivatsya"}],"Tags":["estimate"]}
